<a href="https://colab.research.google.com/github/ranjeev3000/Pandas-Assignment/blob/main/panda_exercise.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.DataFrame({'From_To': ['LoNDon_Paris','MAdrid_miLAN','londON_StochOlm','Budapest_PaRis', 'Brusells_londOn'], 'FlightNumber':[10045,np.nan,10065,np.nan,10085],'RecentDelays':[[23,47],[],[24,43,87],[13],[67,32]],'Airline':['KLM(!)','<Air France>(12)','(British Airways. )', '12 Air France',"Swiss Air"]})

In [ ]:
df.head()

           From_To  FlightNumber  RecentDelays              Airline
0     LoNDon_Paris       10045.0      [23, 47]               KLM(!)
1     MAdrid_miLAN           NaN            []     <Air France>(12)
2  londON_StochOlm       10065.0  [24, 43, 87]  (British Airways. )
3   Budapest_PaRis           NaN          [13]        12 Air France
4  Brusells_londOn       10085.0      [67, 32]            Swiss Air

In [ ]:
df.isnull().sum()

From_To         0
FlightNumber    2
RecentDelays    0
Airline         0
dtype: int64

# Problem 1

In [ ]:
df['FlightNumber'] = 10045+ 10*df.index

In [ ]:
df.head()

           From_To  FlightNumber  RecentDelays              Airline
0     LoNDon_Paris         10045      [23, 47]               KLM(!)
1     MAdrid_miLAN         10055            []     <Air France>(12)
2  londON_StochOlm         10065  [24, 43, 87]  (British Airways. )
3   Budapest_PaRis         10075          [13]        12 Air France
4  Brusells_londOn         10085      [67, 32]            Swiss Air

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  5 non-null      int64
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes

#Problem 2 & Problem 4

In [ ]:

DelCol = df['From_To']
df[['From','To']]= pd.DataFrame(df.From_To.str.split('_',1).tolist(),columns=['From','To'])
df.drop(['From_To'], inplace = True, axis = 1)

In [ ]:
df.reset_index
df.head()

   FlightNumber  RecentDelays              Airline      From        To
0         10045      [23, 47]               KLM(!)    LoNDon     Paris
1         10055            []     <Air France>(12)    MAdrid     miLAN
2         10065  [24, 43, 87]  (British Airways. )    londON  StochOlm
3         10075          [13]        12 Air France  Budapest     PaRis
4         10085      [67, 32]            Swiss Air  Brusells    londOn

# Problem 3

In [ ]:
df[['From']]= pd.DataFrame(df.From.str.capitalize())
df[['To']]= pd.DataFrame(df.To.str.capitalize())

In [ ]:
df

   FlightNumber  RecentDelays              Airline      From        To
0         10045      [23, 47]               KLM(!)    London     Paris
1         10055            []     <Air France>(12)    Madrid     Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stocholm
3         10075          [13]        12 Air France  Budapest     Paris
4         10085      [67, 32]            Swiss Air  Brusells    London

# Problem 5

In [ ]:
df3 = pd.DataFrame(df['RecentDelays'].values.tolist(), columns= [['Delay1','Dwlay2','Delay3']])
df3

  Delay1 Dwlay2 Delay3
0   23.0   47.0    NaN
1    NaN    NaN    NaN
2   24.0   43.0   87.0
3   13.0    NaN    NaN
4   67.0   32.0    NaN

In [ ]:
df.RecentDelays.values

array([list([23, 47]), list([]), list([24, 43, 87]), list([13]),
       list([67, 32])], dtype=object)

In [ ]:
s = df.apply(lambda x: pd.Series(x['RecentDelays']),axis=1).stack().reset_index(level=1, drop=True)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

In [ ]:
s.name= 'RecentDelay'
df.drop('RecentDelays',axis=1).join(s)

   FlightNumber              Airline      From        To  RecentDelay
0         10045               KLM(!)    London     Paris         23.0
0         10045               KLM(!)    London     Paris         47.0
1         10055     <Air France>(12)    Madrid     Milan          NaN
2         10065  (British Airways. )    London  Stocholm         24.0
2         10065  (British Airways. )    London  Stocholm         43.0
2         10065  (British Airways. )    London  Stocholm         87.0
3         10075        12 Air France  Budapest     Paris         13.0
4         10085            Swiss Air  Brusells    London         67.0
4         10085            Swiss Air  Brusells    London         32.0